#include <Carbon.r>

/*
# Build carbonIde app skeleton...
/Developer/Tools/Rez carbonIde.r -s /System/Library/Frameworks/Carbon.framework/Headers -creator "'3PRM'" -o mmIde
*/

data '3PRM' (0, "Owner resource") {
	$"00"                                                 /* . */
};

resource 'vers' (1) {
	0x02, 0x10, final, 0x00, verUS,
	"2.1.1",
	"2.1.1, © 1987-2005 University of Nijmegen"
};

resource 'vers' (2) {
	0x02, 0x10, final, 0x00, verUS,
	"2.1.1",
	"(for Clean Programming System 2.1.1)"
};

resource 'SIZE' (-1) {
	reserved,
	acceptSuspendResumeEvents,
	1,
	canBackground,
	multiFinderAware,
	backgroundAndForeground,
	getFrontClicks,
	acceptChildDiedEvents,
	is32BitCompatible,
	isHighLevelEventAware,
	localAndRemoteHLEvents,
	notStationeryAware,
	dontUseTextEditServices,
	notDisplayManagerAware,
	reserved,
	reserved,
	40566432,
	40566432
};

resource 'BNDL' (128) {
	'3PRM',
	0,
	{	/* array TypeArray: 2 elements */
		/* [1] */
		'FREF',
		{	/* array IDArray: 4 elements */
			/* [1] */
			0, 128,
			/* [2] */
			1, 129,
			/* [3] */
			2, 130,
			/* [4] */
			3, 131
		},
		/* [2] */
		'ICN#',
		{	/* array IDArray: 4 elements */
			/* [1] */
			0, 128,
			/* [2] */
			1, 129,
			/* [3] */
			2, 130,
			/* [4] */
			3, 129
		}
	}
};

resource 'FREF' (128) {	'APPL',	0,	""};
resource 'FREF' (129) {	'TEXT',	1,	""};
resource 'FREF' (130) {	'CgOb',	2,	""};
resource 'FREF' (131) {	'****',	3,	""};

data 'ICN#' (-16455) {
	$"0001 0000 0002 8000 0004 4000 000B 2000"            /* ......Ђ...@... . */
	$"0017 9000 0027 C800 004F C400 008F B200"            /* ..ђ..'И..OД..ЏІ. */
	$"011F 7900 021F 7C80 041F 7C40 083E F820"            /* ..y...|Ђ..|@.>ш  */
	$"103E F810 203E FE08 403E 8104 803F 0082"            /* .>ш. >ю.@>Ѓ.Ђ?.‚ */
	$"403E 6044 203F F028 103C FF1E 081C 600E"            /* @>`D ?р(.<я...`. */
	$"041E 000E 021F 000E 010F C00E 008F FFCE"            /* ..........А..ЏяО */
	$"0047 E43E 0023 C81E 0013 9000 0009 2000"            /* .Gд>.#И...ђ..Ж . */
	$"0004 4000 0002 8000 0001 0000 0000 0000"            /* ..@...Ђ......... */
	$"0001 0000 0003 8000 0007 C000 000F E000"            /* ......Ђ...А...а. */
	$"001F F000 003F F800 007F FC00 00FF FE00"            /* ..р..?ш...ь..яю. */
	$"01FF FF00 03FF FF80 07FF FFC0 0FFF FFE0"            /* .яя..яяЂ.яяА.яяа */
	$"1FFF FFF0 3FFF FFF8 7FFF FFFC FFFF FFFE"            /* .яяр?яяш.яяьяяяю */
	$"7FFF FFFC 3FFF FFF8 1FFF FFFE 0FFF FFFE"            /* .яяь?яяш.яяю.яяю */
	$"07FF FFFE 03FF FFFE 01FF FFFE 00FF FFFE"            /* .яяю.яяю.яяю.яяю */
	$"007F FC3E 003F F81E 001F F000 000F E000"            /* ..ь>.?ш...р...а. */
	$"0007 C000 0003 8000 0001 0000 0000 0000"            /* ..А...Ђ......... */
};

data 'ICN#' (128) {
	$"0001 0000 0002 8000 0004 4000 000B 2000"            /* ......Ђ...@... . */
	$"0017 9000 0027 C800 004F C400 008F B200"            /* ..ђ..'И..OД..ЏІ. */
	$"011F 7900 021F 7C80 041F 7C40 083E F820"            /* ..y...|Ђ..|@.>ш  */
	$"103E F810 203E FE08 403E 8104 803F 0082"            /* .>ш. >ю.@>Ѓ.Ђ?.‚ */
	$"403E 6044 203F F028 103C FF1E 081C 600E"            /* @>`D ?р(.<я...`. */
	$"041E 000E 021F 000E 010F C00E 008F FFCE"            /* ..........А..ЏяО */
	$"0047 E43E 0023 C81E 0013 9000 0009 2000"            /* .Gд>.#И...ђ..Ж . */
	$"0004 4000 0002 8000 0001 0000 0000 0000"            /* ..@...Ђ......... */
	$"0001 0000 0003 8000 0007 C000 000F E000"            /* ......Ђ...А...а. */
	$"001F F000 003F F800 007F FC00 00FF FE00"            /* ..р..?ш...ь..яю. */
	$"01FF FF00 03FF FF80 07FF FFC0 0FFF FFE0"            /* .яя..яяЂ.яяА.яяа */
	$"1FFF FFF0 3FFF FFF8 7FFF FFFC FFFF FFFE"            /* .яяр?яяш.яяьяяяю */
	$"7FFF FFFC 3FFF FFF8 1FFF FFFE 0FFF FFFE"            /* .яяь?яяш.яяю.яяю */
	$"07FF FFFE 03FF FFFE 01FF FFFE 00FF FFFE"            /* .яяю.яяю.яяю.яяю */
	$"007F FC3E 003F F81E 001F F000 000F E000"            /* ..ь>.?ш...р...а. */
	$"0007 C000 0003 8000 0001 0000 0000 0000"            /* ..А...Ђ......... */
};

data 'ICN#' (129) {
	$"0FFF F000 0800 1800 0800 1400 0808 1200"            /* .яр............. */
	$"081C 1100 083E 1080 083F 1040 087E 9FE0"            /* .....>.Ђ.?.@.~џа */
	$"087D C020 08FB E020 08FB F020 08FB E020"            /* .}А .ыа .ыр .ыа  */
	$"09F7 C020 09F7 C020 09F7 C020 09F7 C020"            /* ЖчА ЖчА ЖчА ЖчА  */
	$"09F7 C020 09F7 C020 09F7 C020 09F7 FFFE"            /* ЖчА ЖчА ЖчА Жчяю */
	$"08FB FFFE 08FB BFDE 08FB 8B46 087D BCDE"            /* .ыяю.ыїЮ.ы‹F.}јЮ */
	$"087F BCDE 083F CB66 083F FFFE 081D FFFE"            /* ..јЮ.?Лf.?яю..яю */
	$"0809 FFFE 0800 0020 0800 0020 0FFF FFE0"            /* .Жяю... ... .яяа */
	$"0FFF F000 0FFF F800 0FFF FC00 0FFF FE00"            /* .яр..яш..яь..яю. */
	$"0FFF FF00 0FFF FF80 0FFF FFC0 0FFF FFE0"            /* .яя..яяЂ.яяА.яяа */
	$"0FFF FFE0 0FFF FFE0 0FFF FFE0 0FFF FFE0"            /* .яяа.яяа.яяа.яяа */
	$"0FFF FFE0 0FFF FFE0 0FFF FFE0 0FFF FFE0"            /* .яяа.яяа.яяа.яяа */
	$"0FFF FFE0 0FFF FFE0 0FFF FFE0 0FFF FFFE"            /* .яяа.яяа.яяа.яяю */
	$"0FFF FFFE 0FFF FFFE 0FFF FFFE 0FFF FFFE"            /* .яяю.яяю.яяю.яяю */
	$"0FFF FFFE 0FFF FFFE 0FFF FFFE 0FFF FFFE"            /* .яяю.яяю.яяю.яяю */
	$"0FFF FFFE 0FFF FFE0 0FFF FFE0 0FFF FFE0"            /* .яяю.яяа.яяа.яяа */
};

data 'ICN#' (130) {
	$"0FFF F000 0800 1800 0820 1400 0870 1200"            /* .яр...... ...p.. */
	$"08E8 1100 09DC 1080 09B8 1040 09B0 1FE0"            /* .и..ЖЬ.ЂЖё.@Ж°.а */
	$"09B0 0020 09B8 0020 09DC 0020 08E8 0020"            /* Ж°. Жё. ЖЬ. .и.  */
	$"0870 0020 0820 0020 0800 0020 0800 0020"            /* .p. . . ... ...  */
	$"0800 0020 088C 6020 0992 9020 0893 FFFE"            /* ... .Њ` Ж’ђ .“яю */
	$"09CD FFFE 0801 F9F6 0801 FDFE 08C5 9C62"            /* ЖНяю..щц..эю.Ењb */
	$"092D 6DB6 0925 6DB6 08CF 9876 0801 FFCE"            /* Ж-m¶Ж%m¶.Пv..яО */
	$"0801 FFFE 0800 0020 0800 0020 0FFF FFE0"            /* ..яю... ... .яяа */
	$"0FFF F000 0FFF F800 0FFF FC00 0FFF FE00"            /* .яр..яш..яь..яю. */
	$"0FFF FF00 0FFF FF80 0FFF FFC0 0FFF FFE0"            /* .яя..яяЂ.яяА.яяа */
	$"0FFF FFE0 0FFF FFE0 0FFF FFE0 0FFF FFE0"            /* .яяа.яяа.яяа.яяа */
	$"0FFF FFE0 0FFF FFE0 0FFF FFE0 0FFF FFE0"            /* .яяа.яяа.яяа.яяа */
	$"0FFF FFE0 0FFF FFE0 0FFF FFE0 0FFF FFFE"            /* .яяа.яяа.яяа.яяю */
	$"0FFF FFFE 0FFF FFFE 0FFF FFFE 0FFF FFFE"            /* .яяю.яяю.яяю.яяю */
	$"0FFF FFFE 0FFF FFFE 0FFF FFFE 0FFF FFFE"            /* .яяю.яяю.яяю.яяю */
	$"0FFF FFFE 0FFF FFE0 0FFF FFE0 0FFF FFE0"            /* .яяю.яяа.яяа.яяа */
};

data 'icl4' (-16455) {
	$"0000 0000 0000 000F 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 00F0 F000 0000 0000 0000"            /* .......рр....... */
	$"0000 0000 0000 0F0C DF00 0000 0000 0000"            /* ........Я....... */
	$"0000 0000 0000 F0DD CDF0 0000 0000 0000"            /* ......рЭНр...... */
	$"0000 0000 000F 0DDD DCDF 0000 0000 0000"            /* .......ЭЬЯ...... */
	$"0000 0000 00F0 CDDD DDCD F000 0000 0000"            /* .....рНЭЭНр..... */
	$"0000 0000 0F0C DDDD DDCC DF00 0000 0000"            /* ......ЭЭЭМЯ..... */
	$"0000 0000 F0CC DDDD DCDD CDF0 0000 0000"            /* ....рМЭЭЬЭНр.... */
	$"0000 000F 0CCD DDDD CDDD DCDF 0000 0000"            /* .....НЭЭНЭЬЯ.... */
	$"0000 00F0 CCCD DDDD CDDD DDCD F000 0000"            /* ...рМНЭЭНЭЭНр... */
	$"0000 0F0C CCCD DDDD CDDD DDCC DF00 0000"            /* ....МНЭЭНЭЭМЯ... */
	$"0000 F0CC CCDD DDDC DDDD DCCC CDF0 0000"            /* ..рММЭЭЬЭЭЬМНр.. */
	$"000F 0CCC CCDD DDDC DDDD DCCC CCDF 0000"            /* ...ММЭЭЬЭЭЬММЯ.. */
	$"00F0 CCCC CCDD DDDC DFFF FFFC CCCD F000"            /* .рМММЭЭЬЯяяьМНр. */
	$"0F0C CCCC CCDD DDDC FCCC CCCF CCCC DF00"            /* ..МММЭЭЬьММПММЯ. */
	$"F0CC CCCC CCDD DDDF CCCC CCCC FCCC CDF0"            /* рММММЭЭЯММММьМНр */
	$"0F0C CCCC CCDD DDFC CFFC CCCC CFCC DF00"            /* ..МММЭЭьПьММПМЯ. */
	$"00F0 CCCC CCDD DDFF FDDF CCCC CCFD F000"            /* .рМММЭЭяэЯМММэр. */
	$"000F 0CCC CCDD FFCC FFFF FFFF CCCF FFF0"            /* ...ММЭяМяяяяМПяр */
	$"0000 F0CC CCCD DFCC CFFC CCCC CCCC FFF0"            /* ..рММНЯМПьММММяр */
	$"0000 0F0C CCCD DDFC CCCC CCCC CCCC FFF0"            /* ....МНЭьММММММяр */
	$"0000 00F0 CCCD DDDF CCCC CCCC CCCC FFF0"            /* ...рМНЭЯММММММяр */
	$"0000 000F 0CCC DDDD FFCC CCCC CCCC FFF0"            /* .....МЭЭяМММММяр */
	$"0000 0000 F0CC DDDD DDFF FFFF FFCC FFF0"            /* ....рМЭЭЭяяяяМяр */
	$"0000 0000 0F0C CDDD DDDC DF00 00FF FFF0"            /* ......НЭЭЬЯ..яяр */
	$"0000 0000 00F0 CCDD DDCD F000 000F FFF0"            /* .....рМЭЭНр...яр */
	$"0000 0000 000F 0CDD DCDF 0000 0000 0000"            /* .......ЭЬЯ...... */
	$"0000 0000 0000 F0CD CDF0 0000 0000 0000"            /* ......рННр...... */
	$"0000 0000 0000 0F0C DF00 0000 0000 0000"            /* ........Я....... */
	$"0000 0000 0000 00F0 F000 0000 0000 0000"            /* .......рр....... */
	$"0000 0000 0000 000F 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
};

data 'icl4' (128) {
	$"0000 0000 0000 000F 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 00F0 F000 0000 0000 0000"            /* .......рр....... */
	$"0000 0000 0000 0F0C DF00 0000 0000 0000"            /* ........Я....... */
	$"0000 0000 0000 F0DD CDF0 0000 0000 0000"            /* ......рЭНр...... */
	$"0000 0000 000F 0DDD DCDF 0000 0000 0000"            /* .......ЭЬЯ...... */
	$"0000 0000 00F0 CDDD DDCD F000 0000 0000"            /* .....рНЭЭНр..... */
	$"0000 0000 0F0C DDDD DDCC DF00 0000 0000"            /* ......ЭЭЭМЯ..... */
	$"0000 0000 F0CC DDDD DCDD CDF0 0000 0000"            /* ....рМЭЭЬЭНр.... */
	$"0000 000F 0CCD DDDD CDDD DCDF 0000 0000"            /* .....НЭЭНЭЬЯ.... */
	$"0000 00F0 CCCD DDDD CDDD DDCD F000 0000"            /* ...рМНЭЭНЭЭНр... */
	$"0000 0F0C CCCD DDDD CDDD DDCC DF00 0000"            /* ....МНЭЭНЭЭМЯ... */
	$"0000 F0CC CCDD DDDC DDDD DCCC CDF0 0000"            /* ..рММЭЭЬЭЭЬМНр.. */
	$"000F 0CCC CCDD DDDC DDDD DCCC CCDF 0000"            /* ...ММЭЭЬЭЭЬММЯ.. */
	$"00F0 CCCC CCDD DDDC DFFF FFFC CCCD F000"            /* .рМММЭЭЬЯяяьМНр. */
	$"0F0C CCCC CCDD DDDC FCCC CCCF CCCC DF00"            /* ..МММЭЭЬьММПММЯ. */
	$"F0CC CCCC CCDD DDDF CCCC CCCC FCCC CDF0"            /* рММММЭЭЯММММьМНр */
	$"0F0C CCCC CCDD DDFC CFFC CCCC CFCC DF00"            /* ..МММЭЭьПьММПМЯ. */
	$"00F0 CCCC CCDD DDFF FDDF CCCC CCFD F000"            /* .рМММЭЭяэЯМММэр. */
	$"000F 0CCC CCDD FFCC FFFF FFFF CCCF FFF0"            /* ...ММЭяМяяяяМПяр */
	$"0000 F0CC CCCD DFCC CFFC CCCC CCCC FFF0"            /* ..рММНЯМПьММММяр */
	$"0000 0F0C CCCD DDFC CCCC CCCC CCCC FFF0"            /* ....МНЭьММММММяр */
	$"0000 00F0 CCCD DDDF CCCC CCCC CCCC FFF0"            /* ...рМНЭЯММММММяр */
	$"0000 000F 0CCC DDDD FFCC CCCC CCCC FFF0"            /* .....МЭЭяМММММяр */
	$"0000 0000 F0CC DDDD DDFF FFFF FFCC FFF0"            /* ....рМЭЭЭяяяяМяр */
	$"0000 0000 0F0C CDDD DDDC DF00 00FF FFF0"            /* ......НЭЭЬЯ..яяр */
	$"0000 0000 00F0 CCDD DDCD F000 000F FFF0"            /* .....рМЭЭНр...яр */
	$"0000 0000 000F 0CDD DCDF 0000 0000 0000"            /* .......ЭЬЯ...... */
	$"0000 0000 0000 F0CD CDF0 0000 0000 0000"            /* ......рННр...... */
	$"0000 0000 0000 0F0C DF00 0000 0000 0000"            /* ........Я....... */
	$"0000 0000 0000 00F0 F000 0000 0000 0000"            /* .......рр....... */
	$"0000 0000 0000 000F 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
};

data 'icl4' (129) {
	$"0000 FFFF FFFF FFFF FFFF 0000 0000 0000"            /* ..яяяяяяяя...... */
	$"0000 F000 0000 0000 000F F000 0000 0000"            /* ..р.......р..... */
	$"0000 F0CC CCCC CCCC CCCF 0F00 0000 0000"            /* ..рММММММП...... */
	$"0000 F0CC CCCC DCCC CCCF 0CF0 0000 0000"            /* ..рМММЬММП.р.... */
	$"0000 F0CC CCCD DDCC CCCF 0CCF 0000 0000"            /* ..рММНЭММП.П.... */
	$"0000 F0CC CCDD DDDC CCCF 0CCC F000 0000"            /* ..рММЭЭЬМП.Мр... */
	$"0000 F0CC CCDD DDDD CCCF 0CCC CF00 0000"            /* ..рММЭЭЭМП.МП... */
	$"0000 F0CC CDDD DDDC DCCF FFFF FFF0 0000"            /* ..рМНЭЭЬЬПяяяр.. */
	$"0000 F0CC CDDD DDCD DDCC CCCC CCF0 0000"            /* ..рМНЭЭНЭММММр.. */
	$"0000 F0CC DDDD DCDD DDDC CCCC CCF0 0000"            /* ..рМЭЭЬЭЭЬМММр.. */
	$"0000 F0CC DDDD DCDD DDDD CCCC CCF0 0000"            /* ..рМЭЭЬЭЭЭМММр.. */
	$"0000 F0CC DDDD DCDD DDDC CCCC CCF0 0000"            /* ..рМЭЭЬЭЭЬМММр.. */
	$"0000 F0CD DDDD CDDD DDCC CCCC CCF0 0000"            /* ..рНЭЭНЭЭММММр.. */
	$"0000 F0CD DDDD CDDD DDCC CCCC CCF0 0000"            /* ..рНЭЭНЭЭММММр.. */
	$"0000 F0CD DDDD CDDD DDCC CCCC CCF0 0000"            /* ..рНЭЭНЭЭММММр.. */
	$"0000 F0CD DDDD CDDD DDCC CCCC CCF0 0000"            /* ..рНЭЭНЭЭММММр.. */
	$"0000 F0CD DDDD CDDD DDCC CCCC CCF0 0000"            /* ..рНЭЭНЭЭММММр.. */
	$"0000 F0CD DDDD CDDD DDCC CCCC CCF0 0000"            /* ..рНЭЭНЭЭММММр.. */
	$"0000 F0CD DDDD CDDD DDCC CCCC CCF0 0000"            /* ..рНЭЭНЭЭММММр.. */
	$"0000 F0CD DDDD CDD8 8888 8888 8888 88E0"            /* ..рНЭЭНШ€€€€€€€а */
	$"0000 F0CC DDDD DCD8 DDDD DDDD DDDD DDE0"            /* ..рМЭЭЬШЭЭЭЭЭЭЭа */
	$"0000 F0CC DDDD DCD8 D0DD DDDD DD0D DDE0"            /* ..рМЭЭЬШРЭЭЭЭ.Эа */
	$"0000 F0CC DDDD DCD8 D000 D0DD 0D00 0DE0"            /* ..рМЭЭЬШР.РЭ...а */
	$"0000 F0CC CDDD DDC8 D0DD DD00 DD0D DDE0"            /* ..рМНЭЭИРЭЭ.Э.Эа */
	$"0000 F0CC CDDD DDD8 D0DD DD00 DD0D DDE0"            /* ..рМНЭЭШРЭЭ.Э.Эа */
	$"0000 F0CC CCDD DDD8 DD00 D0DD 0DD0 0DE0"            /* ..рММЭЭШЭ.РЭ.Р.а */
	$"0000 F0CC CCDD DDD8 DDDD DDDD DDDD DDE0"            /* ..рММЭЭШЭЭЭЭЭЭЭа */
	$"0000 F0CC CCCD DDC8 DDDD DDDD DDDD DDE0"            /* ..рММНЭИЭЭЭЭЭЭЭа */
	$"0000 F0CC CCCC DCCE EEEE EEEE EEEE EEE0"            /* ..рМММЬОоооооооа */
	$"0000 F0CC CCCC CCCC CCCC CCCC CCF0 0000"            /* ..рММММММММММр.. */
	$"0000 F0CC CCCC CCCC CCCC CCCC CCF0 0000"            /* ..рММММММММММр.. */
	$"0000 FFFF FFFF FFFF FFFF FFFF FFF0 0000"            /* ..яяяяяяяяяяяр.. */
};

data 'icl4' (130) {
	$"0000 FFFF FFFF FFFF FFFF 0000 0000 0000"            /* ..яяяяяяяя...... */
	$"0000 F000 0000 0000 000F F000 0000 0000"            /* ..р.......р..... */
	$"0000 F0CC CCDC CCCC CCCF 0F00 0000 0000"            /* ..рММЬМММП...... */
	$"0000 F0CC CDDD CCCC CCCF 0CF0 0000 0000"            /* ..рМНЭМММП.р.... */
	$"0000 F0CC DDDC DCCC CCCF 0CCF 0000 0000"            /* ..рМЭЬЬММП.П.... */
	$"0000 F0CD DDCD DDCC CCCF 0CCC F000 0000"            /* ..рНЭНЭММП.Мр... */
	$"0000 F0CD DCDD DCCC CCCF 0CCC CF00 0000"            /* ..рНЬЭЬММП.МП... */
	$"0000 F0CD DCDD CCCC CCCF FFFF FFF0 0000"            /* ..рНЬЭМММПяяяр.. */
	$"0000 F0CD DCDD CCCC CCCC CCCC CCF0 0000"            /* ..рНЬЭМММММММр.. */
	$"0000 F0CD DCDD DCCC CCCC CCCC CCF0 0000"            /* ..рНЬЭЬММММММр.. */
	$"0000 F0CD DDCD DDCC CCCC CCCC CCF0 0000"            /* ..рНЭНЭММММММр.. */
	$"0000 F0CC DDDC DCCC CCCC CCCC CCF0 0000"            /* ..рМЭЬЬММММММр.. */
	$"0000 F0CC CDDD CCCC CCCC CCCC CCF0 0000"            /* ..рМНЭМММММММр.. */
	$"0000 F0CC CCDC CCCC CCCC CCCC CCF0 0000"            /* ..рММЬМММММММр.. */
	$"0000 F0CC CCCC CCCC CCCC CCCC CCF0 0000"            /* ..рММММММММММр.. */
	$"0000 F0CC CCCC CCCC CCCC CCCC CCF0 0000"            /* ..рММММММММММр.. */
	$"0000 F0CC CCCC CCCC CCCC CCCC CCF0 0000"            /* ..рММММММММММр.. */
	$"0000 F0CC ACCC AACC CAAC CCCC CCF0 0000"            /* ..рМ¬МЄМК¬МММр.. */
	$"0000 F0CA ACCA CCAC ACCA CCCC CCF0 0000"            /* ..рК¬КМ¬¬КМММр.. */
	$"0000 F0CC ACCA CCA8 8888 8888 8888 88E0"            /* ..рМ¬КМЁ€€€€€€€а */
	$"0000 F0CA AACC AAC8 DDDD DDDD DDDD DDE0"            /* ..рКЄМЄИЭЭЭЭЭЭЭа */
	$"0000 F0CC CCCC CCC8 DDDD D00D DDDD 0DE0"            /* ..рММММИЭЭР.ЭЭ.а */
	$"0000 F0CC CCCC CCC8 DDDD DD0D DDDD DDE0"            /* ..рММММИЭЭЭ.ЭЭЭа */
	$"0000 F0CC AACC CAC8 D00D DD00 0DD0 00E0"            /* ..рМЄМКИР.Э..Р.а */
	$"0000 F0CA CCAC AAC8 0DD0 DD0D D0DD 0DE0"            /* ..рКМ¬ЄИ.РЭ.РЭ.а */
	$"0000 F0CA CCAC CAC8 0DD0 DD0D D0DD 0DE0"            /* ..рКМ¬КИ.РЭ.РЭ.а */
	$"0000 F0CC AACC AAA8 D00D D000 0DDD 0DE0"            /* ..рМЄМЄЁР.Р..Э.а */
	$"0000 F0CC CCCC CCC8 DDDD DDDD DD00 DDE0"            /* ..рММММИЭЭЭЭЭ.Эа */
	$"0000 F0CC CCCC CCCE EEEE EEEE EEEE EEE0"            /* ..рММММОоооооооа */
	$"0000 F0CC CCCC CCCC CCCC CCCC CCF0 0000"            /* ..рММММММММММр.. */
	$"0000 F0CC CCCC CCCC CCCC CCCC CCF0 0000"            /* ..рММММММММММр.. */
	$"0000 FFFF FFFF FFFF FFFF FFFF FFF0 0000"            /* ..яяяяяяяяяяяр.. */
};

data 'icl8' (-16455) {
	$"0000 0000 0000 0000 0000 0000 0000 00FF"            /* ...............я */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 0000 0000 0000 FF00"            /* ..............я. */
	$"FF00 0000 0000 0000 0000 0000 0000 0000"            /* я............... */
	$"0000 0000 0000 0000 0000 0000 00FF 002B"            /* .............я.+ */
	$"F9FF 0000 0000 0000 0000 0000 0000 0000"            /* щя.............. */
	$"0000 0000 0000 0000 0000 0000 FF00 7F7F"            /* ............я... */
	$"2BF9 FF00 0000 0000 0000 0000 0000 0000"            /* +щя............. */
	$"0000 0000 0000 0000 0000 00FF 007F 7F7F"            /* ...........я.... */
	$"7F2B F9FF 0000 0000 0000 0000 0000 0000"            /* .+щя............ */
	$"0000 0000 0000 0000 0000 FF00 2B7F 7F7F"            /* ..........я.+... */
	$"7F7F 2BF9 FF00 0000 0000 0000 0000 0000"            /* ..+щя........... */
	$"0000 0000 0000 0000 00FF 002B 7F7F 7F7F"            /* .........я.+.... */
	$"7F7F 2A2B F9FF 0000 0000 0000 0000 0000"            /* ..*+щя.......... */
	$"0000 0000 0000 0000 FF00 2B2A 7F7F 7F7F"            /* ........я.+*.... */
	$"7F2A 7F7F 2BF9 FF00 0000 0000 0000 0000"            /* .*..+щя......... */
	$"0000 0000 0000 00FF 002B 2A7F 7F7F 7F7F"            /* .......я.+*..... */
	$"2A7F 7F7F 7F2B F9FF 0000 0000 0000 0000"            /* *....+щя........ */
	$"0000 0000 0000 FF00 2B2A 2B7F 7F7F 7F7F"            /* ......я.+*+..... */
	$"2B7F 7F7F 7F7F 2BF9 FF00 0000 0000 0000"            /* +.....+щя....... */
	$"0000 0000 00FF 002B 2A2B 2A7F 7F7F 7F7F"            /* .....я.+*+*..... */
	$"2A7F 7F7F 7F7F 2A2B F9FF 0000 0000 0000"            /* *.....*+щя...... */
	$"0000 0000 FF00 2B2A 2B2A 7F7F 7F7F 7F2A"            /* ....я.+*+*.....* */
	$"7F7F 7F7F 7F2A 2B2A 2BF9 FF00 0000 0000"            /* .....*+*+щя..... */
	$"0000 00FF 002B 2A2B 2A2B 7F7F 7F7F 7F2B"            /* ...я.+*+*+.....+ */
	$"7F7F 7F7F 7F2B 2A2B 2A2B F9FF 0000 0000"            /* .....+*+*+щя.... */
	$"0000 FF00 2B2A 2B2A 2B2A 7F7F 7F7F 7F2A"            /* ..я.+*+*+*.....* */
	$"7FFF FFFF FFFF FF2A 2B2A 2BF9 FF00 0000"            /* .яяяяяя*+*+щя... */
	$"00FF 002B 2A2B 2A2B 2A2B 7F7F 7F7F 7F2B"            /* .я.+*+*+*+.....+ */
	$"FF08 0808 0808 08FF 2A2B 2A2B F9FF 0000"            /* я......я*+*+щя.. */
	$"FF00 2B2A 2B2A 2B2A 2B2A 7F7F 7F7F 7FFF"            /* я.+*+*+*+*.....я */
	$"0808 0808 0808 0808 FF2A 2B2A 2BF9 FF00"            /* ........я*+*+щя. */
	$"00FF 002B 2A2B 2A2B 2A2B 7F7F 7F7F FF08"            /* .я.+*+*+*+....я. */
	$"08FF FF08 0808 0808 08FF 2A2B F9FF 0000"            /* .яя......я*+щя.. */
	$"0000 FF00 2B2A 2B2A 2B2A 7F7F 7F7F FFFF"            /* ..я.+*+*+*....яя */
	$"FF7F 7FFF 0808 0808 0808 FFF9 FF00 0000"            /* я..я......ящя... */
	$"0000 00FF 002B 2A2B 2A2B 7F7F FFFF 0808"            /* ...я.+*+*+..яя.. */
	$"FFFF FFFF FFFF FFFF 0808 08FF FFFF FF00"            /* яяяяяяяя...яяяя. */
	$"0000 0000 FF00 2B2A 2B2A 2B7F 7FFF 0808"            /* ....я.+*+*+..я.. */
	$"08FF FF08 0808 0808 0808 0808 FFFF FF00"            /* .яя.........яяя. */
	$"0000 0000 00FF 002B 2A2B 2A7F 7F7F FF08"            /* .....я.+*+*...я. */
	$"0808 0808 0808 0808 0808 0808 FFFF FF00"            /* ............яяя. */
	$"0000 0000 0000 FF00 2B2A 2B7F 7F7F 7FFF"            /* ......я.+*+....я */
	$"0808 0808 0808 0808 0808 0808 FFFF FF00"            /* ............яяя. */
	$"0000 0000 0000 00FF 002B 2A2B 7F7F 7F7F"            /* .......я.+*+.... */
	$"FFFF 0808 0808 0808 0808 0808 FFFF FF00"            /* яя..........яяя. */
	$"0000 0000 0000 0000 FF00 2B2A 7F7F 7F7F"            /* ........я.+*.... */
	$"7F7F FFFF FFFF FFFF FFFF 0808 FFFF FF00"            /* ..яяяяяяяя..яяя. */
	$"0000 0000 0000 0000 00FF 002B 2A7F 7F7F"            /* .........я.+*... */
	$"7F7F 7F2B F9FF 0000 0000 FFFF FFFF FF00"            /* ...+щя....яяяяя. */
	$"0000 0000 0000 0000 0000 FF00 2B2A 7F7F"            /* ..........я.+*.. */
	$"7F7F 2BF9 FF00 0000 0000 00FF FFFF FF00"            /* ..+щя......яяяя. */
	$"0000 0000 0000 0000 0000 00FF 002B 7F7F"            /* ...........я.+.. */
	$"7F2B F9FF 0000 0000 0000 0000 0000 0000"            /* .+щя............ */
	$"0000 0000 0000 0000 0000 0000 FF00 2B7F"            /* ............я.+. */
	$"2BF9 FF00 0000 0000 0000 0000 0000 0000"            /* +щя............. */
	$"0000 0000 0000 0000 0000 0000 00FF 002B"            /* .............я.+ */
	$"F9FF 0000 0000 0000 0000 0000 0000 0000"            /* щя.............. */
	$"0000 0000 0000 0000 0000 0000 0000 FF00"            /* ..............я. */
	$"FF00 0000 0000 0000 0000 0000 0000 0000"            /* я............... */
	$"0000 0000 0000 0000 0000 0000 0000 00FF"            /* ...............я */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
};

data 'icl8' (128) {
	$"0000 0000 0000 0000 0000 0000 0000 00FF"            /* ...............я */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 0000 0000 0000 FF00"            /* ..............я. */
	$"FF00 0000 0000 0000 0000 0000 0000 0000"            /* я............... */
	$"0000 0000 0000 0000 0000 0000 00FF 002B"            /* .............я.+ */
	$"F9FF 0000 0000 0000 0000 0000 0000 0000"            /* щя.............. */
	$"0000 0000 0000 0000 0000 0000 FF00 7F7F"            /* ............я... */
	$"2BF9 FF00 0000 0000 0000 0000 0000 0000"            /* +щя............. */
	$"0000 0000 0000 0000 0000 00FF 007F 7F7F"            /* ...........я.... */
	$"7F2B F9FF 0000 0000 0000 0000 0000 0000"            /* .+щя............ */
	$"0000 0000 0000 0000 0000 FF00 2B7F 7F7F"            /* ..........я.+... */
	$"7F7F 2BF9 FF00 0000 0000 0000 0000 0000"            /* ..+щя........... */
	$"0000 0000 0000 0000 00FF 002B 7F7F 7F7F"            /* .........я.+.... */
	$"7F7F 2A2B F9FF 0000 0000 0000 0000 0000"            /* ..*+щя.......... */
	$"0000 0000 0000 0000 FF00 2B2A 7F7F 7F7F"            /* ........я.+*.... */
	$"7F2A 7F7F 2BF9 FF00 0000 0000 0000 0000"            /* .*..+щя......... */
	$"0000 0000 0000 00FF 002B 2A7F 7F7F 7F7F"            /* .......я.+*..... */
	$"2A7F 7F7F 7F2B F9FF 0000 0000 0000 0000"            /* *....+щя........ */
	$"0000 0000 0000 FF00 2B2A 2B7F 7F7F 7F7F"            /* ......я.+*+..... */
	$"2B7F 7F7F 7F7F 2BF9 FF00 0000 0000 0000"            /* +.....+щя....... */
	$"0000 0000 00FF 002B 2A2B 2A7F 7F7F 7F7F"            /* .....я.+*+*..... */
	$"2A7F 7F7F 7F7F 2A2B F9FF 0000 0000 0000"            /* *.....*+щя...... */
	$"0000 0000 FF00 2B2A 2B2A 7F7F 7F7F 7F2A"            /* ....я.+*+*.....* */
	$"7F7F 7F7F 7F2A 2B2A 2BF9 FF00 0000 0000"            /* .....*+*+щя..... */
	$"0000 00FF 002B 2A2B 2A2B 7F7F 7F7F 7F2B"            /* ...я.+*+*+.....+ */
	$"7F7F 7F7F 7F2B 2A2B 2A2B F9FF 0000 0000"            /* .....+*+*+щя.... */
	$"0000 FF00 2B2A 2B2A 2B2A 7F7F 7F7F 7F2A"            /* ..я.+*+*+*.....* */
	$"7FFF FFFF FFFF FF2A 2B2A 2BF9 FF00 0000"            /* .яяяяяя*+*+щя... */
	$"00FF 002B 2A2B 2A2B 2A2B 7F7F 7F7F 7F2B"            /* .я.+*+*+*+.....+ */
	$"FF08 0808 0808 08FF 2A2B 2A2B F9FF 0000"            /* я......я*+*+щя.. */
	$"FF00 2B2A 2B2A 2B2A 2B2A 7F7F 7F7F 7FFF"            /* я.+*+*+*+*.....я */
	$"0808 0808 0808 0808 FF2A 2B2A 2BF9 FF00"            /* ........я*+*+щя. */
	$"00FF 002B 2A2B 2A2B 2A2B 7F7F 7F7F FF08"            /* .я.+*+*+*+....я. */
	$"08FF FF08 0808 0808 08FF 2A2B F9FF 0000"            /* .яя......я*+щя.. */
	$"0000 FF00 2B2A 2B2A 2B2A 7F7F 7F7F FFFF"            /* ..я.+*+*+*....яя */
	$"FF7F 7FFF 0808 0808 0808 FFF9 FF00 0000"            /* я..я......ящя... */
	$"0000 00FF 002B 2A2B 2A2B 7F7F FFFF 0808"            /* ...я.+*+*+..яя.. */
	$"FFFF FFFF FFFF FFFF 0808 08FF FFFF FF00"            /* яяяяяяяя...яяяя. */
	$"0000 0000 FF00 2B2A 2B2A 2B7F 7FFF 0808"            /* ....я.+*+*+..я.. */
	$"08FF FF08 0808 0808 0808 0808 FFFF FF00"            /* .яя.........яяя. */
	$"0000 0000 00FF 002B 2A2B 2A7F 7F7F FF08"            /* .....я.+*+*...я. */
	$"0808 0808 0808 0808 0808 0808 FFFF FF00"            /* ............яяя. */
	$"0000 0000 0000 FF00 2B2A 2B7F 7F7F 7FFF"            /* ......я.+*+....я */
	$"0808 0808 0808 0808 0808 0808 FFFF FF00"            /* ............яяя. */
	$"0000 0000 0000 00FF 002B 2A2B 7F7F 7F7F"            /* .......я.+*+.... */
	$"FFFF 0808 0808 0808 0808 0808 FFFF FF00"            /* яя..........яяя. */
	$"0000 0000 0000 0000 FF00 2B2A 7F7F 7F7F"            /* ........я.+*.... */
	$"7F7F FFFF FFFF FFFF FFFF 0808 FFFF FF00"            /* ..яяяяяяяя..яяя. */
	$"0000 0000 0000 0000 00FF 002B 2A7F 7F7F"            /* .........я.+*... */
	$"7F7F 7F2B F9FF 0000 0000 FFFF FFFF FF00"            /* ...+щя....яяяяя. */
	$"0000 0000 0000 0000 0000 FF00 2B2A 7F7F"            /* ..........я.+*.. */
	$"7F7F 2BF9 FF00 0000 0000 00FF FFFF FF00"            /* ..+щя......яяяя. */
	$"0000 0000 0000 0000 0000 00FF 002B 7F7F"            /* ...........я.+.. */
	$"7F2B F9FF 0000 0000 0000 0000 0000 0000"            /* .+щя............ */
	$"0000 0000 0000 0000 0000 0000 FF00 2B7F"            /* ............я.+. */
	$"2BF9 FF00 0000 0000 0000 0000 0000 0000"            /* +щя............. */
	$"0000 0000 0000 0000 0000 0000 00FF 002B"            /* .............я.+ */
	$"F9FF 0000 0000 0000 0000 0000 0000 0000"            /* щя.............. */
	$"0000 0000 0000 0000 0000 0000 0000 FF00"            /* ..............я. */
	$"FF00 0000 0000 0000 0000 0000 0000 0000"            /* я............... */
	$"0000 0000 0000 0000 0000 0000 0000 00FF"            /* ...............я */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
};

data 'icl8' (129) {
	$"0000 0000 FFFF FFFF FFFF FFFF FFFF FFFF"            /* ....яяяяяяяяяяяя */
	$"FFFF FFFF 0000 0000 0000 0000 0000 0000"            /* яяяя............ */
	$"0000 0000 FFF5 F5F5 F5F5 F5F5 F5F5 F5F5"            /* ....яххххххххххх */
	$"F5F5 F5FF FF00 0000 0000 0000 0000 0000"            /* хххяя........... */
	$"0000 0000 FFF5 2A2B 2A2B 2A2B 2A2B 2A2B"            /* ....ях*+*+*+*+*+ */
	$"2A2B 2AFF F5FF 0000 0000 0000 0000 0000"            /* *+*яхя.......... */
	$"0000 0000 FFF5 2B2A 2B2A 2B2A 7F2A 2B2A"            /* ....ях+*+*+*.*+* */
	$"2B2A 2BFF F52A FF00 0000 0000 0000 0000"            /* +*+ях*я......... */
	$"0000 0000 FFF5 2A2B 2A2B 2A7F 7F7F 2A2B"            /* ....ях*+*+*...*+ */
	$"2A2B 2AFF F52B 2AFF 0000 0000 0000 0000"            /* *+*ях+*я........ */
	$"0000 0000 FFF5 2B2A 2B2A 7F7F 7F7F 7F2A"            /* ....ях+*+*.....* */
	$"2B2A 2BFF F52A 2B2A FF00 0000 0000 0000"            /* +*+ях*+*я....... */
	$"0000 0000 FFF5 2A2B 2A2B 7F7F 7F7F 7F7F"            /* ....ях*+*+...... */
	$"2A2B 2AFF F5F8 F8F8 F8FF 0000 0000 0000"            /* *+*яхшшшшя...... */
	$"0000 0000 FFF5 2B2A 2B7F 7F7F 7F7F 7F2A"            /* ....ях+*+......* */
	$"7F2A 2BFF FFFF FFFF FFFF FF00 0000 0000"            /* .*+яяяяяяяя..... */
	$"0000 0000 FFF5 2A2B 2A7F 7F7F 7F7F 2A7F"            /* ....ях*+*.....*. */
	$"7F7F 2A2B 2A2B 2A2B 2AF8 FF00 0000 0000"            /* ..*+*+*+*шя..... */
	$"0000 0000 FFF5 2B2A 7F7F 7F7F 7F2A 7F7F"            /* ....ях+*.....*.. */
	$"7F7F 7F2A 2B2A 2B2A 2BF8 FF00 0000 0000"            /* ...*+*+*+шя..... */
	$"0000 0000 FFF5 2A2B 7F7F 7F7F 7F2B 7F7F"            /* ....ях*+.....+.. */
	$"7F7F 7F7F 2A2B 2A2B 2AF8 FF00 0000 0000"            /* ....*+*+*шя..... */
	$"0000 0000 FFF5 2B2A 7F7F 7F7F 7F2A 7F7F"            /* ....ях+*.....*.. */
	$"7F7F 7F2A 2B2A 2B2A 2BF8 FF00 0000 0000"            /* ...*+*+*+шя..... */
	$"0000 0000 FFF5 2A7F 7F7F 7F7F 2A7F 7F7F"            /* ....ях*.....*... */
	$"7F7F 2A2B 2A2B 2A2B 2AF8 FF00 0000 0000"            /* ..*+*+*+*шя..... */
	$"0000 0000 FFF5 2B7F 7F7F 7F7F 2B7F 7F7F"            /* ....ях+.....+... */
	$"7F7F 2B2A 2B2A 2B2A 2BF8 FF00 0000 0000"            /* ..+*+*+*+шя..... */
	$"0000 0000 FFF5 2A7F 7F7F 7F7F 2A7F 7F7F"            /* ....ях*.....*... */
	$"7F7F 2A2B 2A2B 2A2B 2AF8 FF00 0000 0000"            /* ..*+*+*+*шя..... */
	$"0000 0000 FFF5 2B7F 7F7F 7F7F 2B7F 7F7F"            /* ....ях+.....+... */
	$"7F7F 2B2A 2B2A 2B2A 2BF8 FF00 0000 0000"            /* ..+*+*+*+шя..... */
	$"0000 0000 FFF5 2A7F 7F7F 7F7F 2A7F 7F7F"            /* ....ях*.....*... */
	$"7F7F 2A2B 2A2B 2A2B 2AF8 FF00 0000 0000"            /* ..*+*+*+*шя..... */
	$"0000 0000 FFF5 2B7F 7F7F 7F7F 2B7F 7F7F"            /* ....ях+.....+... */
	$"7F7F 2B2A 2B2A 2B2A 2BF8 FF00 0000 0000"            /* ..+*+*+*+шя..... */
	$"0000 0000 FFF5 2A7F 7F7F 7F7F 2A7F 7F7F"            /* ....ях*.....*... */
	$"7F7F 2A2B 2A2B 2A2B 2AF8 FF00 0000 0000"            /* ..*+*+*+*шя..... */
	$"0000 0000 FFF5 2B7F 7F7F 7F7F 2B7F 7FE3"            /* ....ях+.....+..г */
	$"E3E3 E3E3 E3E3 E3E3 E3E3 E3E3 E3E3 A500"            /* ггггггггггггггҐ. */
	$"0000 0000 FFF5 2A2B 7F7F 7F7F 7F2B 7FE3"            /* ....ях*+.....+.г */
	$"9F9F 9F9F 9F9F 9F9F 9F9F 9F9F 9F9F A500"            /* џџџџџџџџџџџџџџҐ. */
	$"0000 0000 FFF5 2B2A 7F7F 7F7F 7F2A 7FE3"            /* ....ях+*.....*.г */
	$"9F00 9F9F 9F9F 9F9F 9F9F 009F 9F9F A500"            /* џ.џџџџџџџџ.џџџҐ. */
	$"0000 0000 FFF5 2A2B 7F7F 7F7F 7F2B 7FE3"            /* ....ях*+.....+.г */
	$"9F00 0000 9F00 9F9F 009F 0000 009F A500"            /* џ...џ.џџ.џ...џҐ. */
	$"0000 0000 FFF5 2B2A 2B7F 7F7F 7F7F 2BE3"            /* ....ях+*+.....+г */
	$"9F00 9F9F 9F9F 0000 9F9F 009F 9F9F A500"            /* џ.џџџџ..џџ.џџџҐ. */
	$"0000 0000 FFF5 2A2B 2A7F 7F7F 7F7F 7FE3"            /* ....ях*+*......г */
	$"9F00 9F9F 9F9F 0000 9F9F 009F 9F9F A500"            /* џ.џџџџ..џџ.џџџҐ. */
	$"0000 0000 FFF5 2B2A 2B2A 7F7F 7F7F 7FE3"            /* ....ях+*+*.....г */
	$"9F9F 0000 9F00 9F9F 009F 9F00 009F A500"            /* џџ..џ.џџ.џџ..џҐ. */
	$"0000 0000 FFF5 2A2B 2A2B 7F7F 7F7F 7FE3"            /* ....ях*+*+.....г */
	$"9F9F 9F9F 9F9F 9F9F 9F9F 9F9F 9F9F A500"            /* џџџџџџџџџџџџџџҐ. */
	$"0000 0000 FFF5 2B2A 2B2A 2B7F 7F7F 2BE3"            /* ....ях+*+*+...+г */
	$"9F9F 9F9F 9F9F 9F9F 9F9F 9F9F 9F9F A500"            /* џџџџџџџџџџџџџџҐ. */
	$"0000 0000 FFF5 2A2B 2A2B 2A2B 7F2B 2AA5"            /* ....ях*+*+*+.+*Ґ */
	$"A5A5 A5A5 A5A5 A5A5 A5A5 A5A5 A5A5 A500"            /* ҐҐҐҐҐҐҐҐҐҐҐҐҐҐҐ. */
	$"0000 0000 FFF5 2B2A 2B2A 2B2A 2B2A 2B2A"            /* ....ях+*+*+*+*+* */
	$"2B2A 2B2A 2B2A 2B2A 2BF8 FF00 0000 0000"            /* +*+*+*+*+шя..... */
	$"0000 0000 FFF5 F8F8 F8F8 F8F8 F8F8 F8F8"            /* ....яхшшшшшшшшшш */
	$"F8F8 F8F8 F8F8 F8F8 F8F8 FF00 0000 0000"            /* шшшшшшшшшшя..... */
	$"0000 0000 FFFF FFFF FFFF FFFF FFFF FFFF"            /* ....яяяяяяяяяяяя */
	$"FFFF FFFF FFFF FFFF FFFF FF00 0000 0000"            /* яяяяяяяяяяя..... */
};

data 'icl8' (130) {
	$"0000 0000 FFFF FFFF FFFF FFFF FFFF FFFF"            /* ....яяяяяяяяяяяя */
	$"FFFF FFFF 0000 0000 0000 0000 0000 0000"            /* яяяя............ */
	$"0000 0000 FFF5 F5F5 F5F5 F5F5 F5F5 F5F5"            /* ....яххххххххххх */
	$"F5F5 F5FF FF00 0000 0000 0000 0000 0000"            /* хххяя........... */
	$"0000 0000 FFF5 2B2A 2B2A 7F2A 2B2A 2B2A"            /* ....ях+*+*.*+*+* */
	$"2B2A 2BFF F5FF 0000 0000 0000 0000 0000"            /* +*+яхя.......... */
	$"0000 0000 FFF5 2A2B 2A7F 7F7F 2A2B 2A2B"            /* ....ях*+*...*+*+ */
	$"2A2B 2AFF F52A FF00 0000 0000 0000 0000"            /* *+*ях*я......... */
	$"0000 0000 FFF5 2B2A 7F7F 7F2B 7F2A 2B2A"            /* ....ях+*...+.*+* */
	$"2B2A 2BFF F52B 2AFF 0000 0000 0000 0000"            /* +*+ях+*я........ */
	$"0000 0000 FFF5 2A7F 7F7F 2B7F 7F7F 2A2B"            /* ....ях*...+...*+ */
	$"2A2B 2AFF F52A 2B2A FF00 0000 0000 0000"            /* *+*ях*+*я....... */
	$"0000 0000 FFF5 2B7F 7F2B 7F7F 7F2A 2B2A"            /* ....ях+..+...*+* */
	$"2B2A 2BFF F5F8 F8F8 F8FF 0000 0000 0000"            /* +*+яхшшшшя...... */
	$"0000 0000 FFF5 2A7F 7F2A 7F7F 2A2B 2A2B"            /* ....ях*..*..*+*+ */
	$"2A2B 2AFF FFFF FFFF FFFF FF00 0000 0000"            /* *+*яяяяяяяя..... */
	$"0000 0000 FFF5 2B7F 7F2B 7F7F 2A2A 2B2A"            /* ....ях+..+..**+* */
	$"2B2A 2B2A 2B2A 2B2A 2BF8 FF00 0000 0000"            /* +*+*+*+*+шя..... */
	$"0000 0000 FFF5 2A7F 7F2A 7F7F 7F2A 2A2B"            /* ....ях*..*...**+ */
	$"2A2B 2A2B 2A2B 2A2B 2AF8 FF00 0000 0000"            /* *+*+*+*+*шя..... */
	$"0000 0000 FFF5 2B7F 7F7F 2A7F 7F7F 2B2A"            /* ....ях+...*...+* */
	$"2B2A 2B2A 2B2A 2B2A 2BF8 FF00 0000 0000"            /* +*+*+*+*+шя..... */
	$"0000 0000 FFF5 2A2B 7F7F 7F2A 7F2B 2A2B"            /* ....ях*+...*.+*+ */
	$"2A2B 2A2B 2A2B 2A2B 2AF8 FF00 0000 0000"            /* *+*+*+*+*шя..... */
	$"0000 0000 FFF5 2B2A 2B7F 7F7F 2A2A 2B2A"            /* ....ях+*+...**+* */
	$"2B2A 2B2A 2B2A 2B2A 2BF8 FF00 0000 0000"            /* +*+*+*+*+шя..... */
	$"0000 0000 FFF5 2A2B 2A2B 7F2A 2A2B 2A2B"            /* ....ях*+*+.**+*+ */
	$"2A2B 2A2B 2A2B 2A2B 2AF8 FF00 0000 0000"            /* *+*+*+*+*шя..... */
	$"0000 0000 FFF5 2B2A 2B2A 2B2A 2B2A 2B2A"            /* ....ях+*+*+*+*+* */
	$"2B2A 2B2A 2B2A 2B2A 2BF8 FF00 0000 0000"            /* +*+*+*+*+шя..... */
	$"0000 0000 FFF5 2A2B 2A2B 2A2B 2A2B 2A2B"            /* ....ях*+*+*+*+*+ */
	$"2A2B 2A2B 2A2B 2A2B 2AF8 FF00 0000 0000"            /* *+*+*+*+*шя..... */
	$"0000 0000 FFF5 2B2A 2B2A 2B2A 2B2A 2B2A"            /* ....ях+*+*+*+*+* */
	$"2B2A 2B2A 2B2A 2B2A 2BF8 FF00 0000 0000"            /* +*+*+*+*+шя..... */
	$"0000 0000 FFF5 2A2B FD2B 2A2B FDFD 2A2B"            /* ....ях*+э+*+ээ*+ */
	$"2AFD FD2B 2A2B 2A2B 2AF8 FF00 0000 0000"            /* *ээ+*+*+*шя..... */
	$"0000 0000 FFF5 2BFD FD2A 2BFD 2B2A FD2A"            /* ....ях+ээ*+э+*э* */
	$"FD2A 2BFD 2B2A 2B2A 2BF8 FF00 0000 0000"            /* э*+э+*+*+шя..... */
	$"0000 0000 FFF5 2A2B FD2B 2AFD 2A2B FDE3"            /* ....ях*+э+*э*+эг */
	$"E3E3 E3E3 E3E3 E3E3 E3E3 E3E3 E3E3 A500"            /* ггггггггггггггҐ. */
	$"0000 0000 FFF5 2BFD FDFD 2B2A FDFD 2BE3"            /* ....ях+эээ+*ээ+г */
	$"9F9F 9F9F 9F9F 9F9F 9F9F 9F9F 9F9F A500"            /* џџџџџџџџџџџџџџҐ. */
	$"0000 0000 FFF5 2A2B 2A2B 2A2B 2A2B 2AE3"            /* ....ях*+*+*+*+*г */
	$"9F9F 9F9F 9F00 009F 9F9F 9F9F 009F A500"            /* џџџџџ..џџџџџ.џҐ. */
	$"0000 0000 FFF5 2B2A 2B2A 2B2A 2B2A 2BE3"            /* ....ях+*+*+*+*+г */
	$"9F9F 9F9F 9F9F 009F 9F9F 9F9F 9F9F A500"            /* џџџџџџ.џџџџџџџҐ. */
	$"0000 0000 FFF5 2A2B FDFD 2A2B 2AFD 2AE3"            /* ....ях*+ээ*+*э*г */
	$"9F00 009F 9F9F 0000 009F 9F00 0000 A500"            /* џ..џџџ...џџ...Ґ. */
	$"0000 0000 FFF5 2BFD 2B2A FD2A FDFD 2BE3"            /* ....ях+э+*э*ээ+г */
	$"009F 9F00 9F9F 009F 9F00 9F9F 009F A500"            /* .џџ.џџ.џџ.џџ.џҐ. */
	$"0000 0000 FFF5 2AFD 2A2B FD2B 2AFD 2AE3"            /* ....ях*э*+э+*э*г */
	$"009F 9F00 9F9F 009F 9F00 9F9F 009F A500"            /* .џџ.џџ.џџ.џџ.џҐ. */
	$"0000 0000 FFF5 2B2A FDFD 2B2A FDFD FDE3"            /* ....ях+*ээ+*эээг */
	$"9F00 009F 9F00 0000 009F 9F9F 009F A500"            /* џ..џџ....џџџ.џҐ. */
	$"0000 0000 FFF5 2A2B 2B2B 2B2B 2B2B 2BE3"            /* ....ях*++++++++г */
	$"9F9F 9F9F 9F9F 9F9F 9F9F 0000 9F9F A500"            /* џџџџџџџџџџ..џџҐ. */
	$"0000 0000 FFF5 2B2A 2B2A 2B2A 2B2A 2BA5"            /* ....ях+*+*+*+*+Ґ */
	$"A5A5 A5A5 A5A5 A5A5 A5A5 A5A5 A5A5 A500"            /* ҐҐҐҐҐҐҐҐҐҐҐҐҐҐҐ. */
	$"0000 0000 FFF5 2A2B 2A2B 2A2B 2A2B 2A2B"            /* ....ях*+*+*+*+*+ */
	$"2A2B 2A2B 2A2B 2A2B 2AF8 FF00 0000 0000"            /* *+*+*+*+*шя..... */
	$"0000 0000 FFF5 F8F8 F8F8 F8F8 F8F8 F8F8"            /* ....яхшшшшшшшшшш */
	$"F8F8 F8F8 F8F8 F8F8 F8F8 FF00 0000 0000"            /* шшшшшшшшшшя..... */
	$"0000 0000 FFFF FFFF FFFF FFFF FFFF FFFF"            /* ....яяяяяяяяяяяя */
	$"FFFF FFFF FFFF FFFF FFFF FF00 0000 0000"            /* яяяяяяяяяяя..... */
};

data 'ics#' (-16455) {
	$"0180 03C0 07E0 0B70 16F8 26EC 46F6 879B"            /* .Ђ.А.а.p.ш&мFц‡› */
	$"C7CE 66F7 3703 1BFB 0FA7 0740 0380 0100"            /* ЗОfч7..ы.§.@.Ђ.. */
	$"0180 03C0 07E0 0FF0 1FF8 3FFC 7FFE FFFF"            /* .Ђ.А.а.р.ш?ь.юяя */
	$"FFFE 7FFF 3FFF 1FFF 0FE7 07C0 0380 0100"            /* яю.я?я.я.з.А.Ђ.. */
};

data 'ics#' (128) {
	$"0180 03C0 07E0 0B70 16F8 26EC 46F6 879B"            /* .Ђ.А.а.p.ш&мFц‡› */
	$"C7CE 66F7 3703 1BFB 0FA7 0740 0380 0100"            /* ЗОfч7..ы.§.@.Ђ.. */
	$"0180 03C0 07E0 0FF0 1FF8 3FFC 7FFE FFFF"            /* .Ђ.А.а.р.ш?ь.юяя */
	$"FFFE 7FFF 3FFF 1FFF 0FE7 07C0 0380 0100"            /* яю.я?я.я.з.А.Ђ.. */
};

data 'ics#' (129) {
	$"3FE0 2270 2758 2FFC 2EC4 2DC4 3D84 3D84"            /* ?а"p'X/ь.Д-Д=„=„ */
	$"3D84 3DF7 2FFF 2FFF 2FFF 27FF 23F7 3FFC"            /* =„=ч/я/я/я'я#ч?ь */
	$"3FE0 3FF0 3FF8 3FFC 3FFC 3FFC 3FFC 3FFC"            /* ?а?р?ш?ь?ь?ь?ь?ь */
	$"3FFC 3FFF 3FFF 3FFF 3FFF 3FFF 3FFF 3FFC"            /* ?ь?я?я?я?я?я?я?ь */
};

data 'ics#' (130) {
	$"3FE0 2C70 3A58 367C 3604 3A04 2C04 2004"            /* ?а,p:X6|6.:.,. . */
	$"2AC4 3DF7 3BFF 2BFF 37FF 2BFF 21F7 3FFC"            /* *Д=ч;я+я7я+я!ч?ь */
	$"3FE0 3FF0 3FF8 3FFC 3FFC 3FFC 3FFC 3FFC"            /* ?а?р?ш?ь?ь?ь?ь?ь */
	$"3FFC 3FFF 3FFF 3FFF 3FFF 3FFF 3FFF 3FFC"            /* ?ь?я?я?я?я?я?я?ь */
};

data 'ics4' (-16455) {
	$"0000 000F F000 0000 0000 00FD FF00 0000"            /* ....р......эя... */
	$"0000 0FDD DFF0 0000 0000 FCDD CDFF 0000"            /* ...ЭЯр....ьЭНя.. */
	$"000F CDDC DDDF F000 00FC CDDC DDDC FF00"            /* ..НЬЭЯр..ьНЬЭЬя. */
	$"0FCC CDDC FFFF CFF0 FCCC CDDF FCCF FCFF"            /* .МНЬяяПрьМНЯьПья */
	$"FFCC CDDF FFCC FFF0 0FFC CDFC FFFF CFFF"            /* яМНЯяМяр.ьНьяяПя */
	$"00FF CDDF CCCC CCFF 000F FCDD FFFF FCFF"            /* .яНЯМММя..ьЭяяья */
	$"0000 FFDD DDF0 0FFF 0000 0FFD DF00 0000"            /* ..яЭЭр.я...эЯ... */
	$"0000 00FF F000 0000 0000 000F 0000 0000"            /* ...яр........... */
};

data 'ics4' (128) {
	$"0000 000F F000 0000 0000 00FD FF00 0000"            /* ....р......эя... */
	$"0000 0FDD DFF0 0000 0000 FCDD CDFF 0000"            /* ...ЭЯр....ьЭНя.. */
	$"000F CDDC DDDF F000 00FC CDDC DDDC FF00"            /* ..НЬЭЯр..ьНЬЭЬя. */
	$"0FCC CDDC FFFF CFF0 FCCC CDDF FCCF FCFF"            /* .МНЬяяПрьМНЯьПья */
	$"FFCC CDDF FFCC FFF0 0FFC CDFC FFFF CFFF"            /* яМНЯяМяр.ьНьяяПя */
	$"00FF CDDF CCCC CCFF 000F FCDD FFFF FCFF"            /* .яНЯМММя..ьЭяяья */
	$"0000 FFDD DDF0 0FFF 0000 0FFD DF00 0000"            /* ..яЭЭр.я...эЯ... */
	$"0000 00FF F000 0000 0000 000F 0000 0000"            /* ...яр........... */
};

data 'ics4' (129) {
	$"00FF FFFF FFF0 0000 00FC CCDC CFFF 0000"            /* .яяяяр...ьМЬПя.. */
	$"00FC CDDD CF0F F000 00FC DDDD DFFF FF00"            /* .ьНЭП.р..ьЭЭЯяя. */
	$"00FC DDDC DDCC CF00 00FC DDCD DDCC CF00"            /* .ьЭЬЭМП..ьЭНЭМП. */
	$"00FD DDCD DCCC CF00 00FD DDCD DCCC CF00"            /* .эЭНЬМП..эЭНЬМП. */
	$"00FD DDCD DCCC CF00 00FD DDC8 8888 CF8E"            /* .эЭНЬМП..эЭИ€€ПЋ */
	$"00FC DDD8 DDDD DDDE 00FC DDD8 DDDD DDDE"            /* .ьЭШЭЭЭЮ.ьЭШЭЭЭЮ */
	$"00FC DDD8 DDDD DDDE 00FC CDD8 DDDD DDDE"            /* .ьЭШЭЭЭЮ.ьНШЭЭЭЮ */
	$"00FC CCDE EEEE CFEE 00FF FFFF FFFF FF00"            /* .ьМЮооПо.яяяяяя. */
};

data 'ics4' (130) {
	$"00FF FFFF FFF0 0000 00FC DDCC CFFF 0000"            /* .яяяяр...ьЭМПя.. */
	$"00FD DCDC CF0F F000 00FD CDDC CFFF FF00"            /* .эЬЬП.р..эНЬПяя. */
	$"00FD CDDC CCCC CF00 00FD DCDC CCCC CF00"            /* .эНЬММП..эЬЬММП. */
	$"00FC DDCC CCCC CF00 00FC CCCC CCCC CF00"            /* .ьЭМММП..ьММММП. */
	$"00FC ACAC AACC CF00 00FA AACA AA88 CF8E"            /* .ь¬¬ЄМП..ъЄКЄ€ПЋ */
	$"00FA ACA8 DDDD DDDE 00FC ACA8 DDDD DDDE"            /* .ъ¬ЁЭЭЭЮ.ь¬ЁЭЭЭЮ */
	$"00FA CAA8 DDDD DDDE 00FC ACAA DDDD DDDE"            /* .ъКЁЭЭЭЮ.ь¬ЄЭЭЭЮ */
	$"00FC CCCE EEEE CFEE 00FF FFFF FFFF FF00"            /* .ьМОооПо.яяяяяя. */
};

data 'ics8' (-16455) {
	$"0000 0000 0000 00FF FF00 0000 0000 0000"            /* .......яя....... */
	$"0000 0000 0000 FF7F FFFF 0000 0000 0000"            /* ......я.яя...... */
	$"0000 0000 00FF 7F7F 7FFF FF00 0000 0000"            /* .....я...яя..... */
	$"0000 0000 FF2B 7F7F 2B7F FFFF 0000 0000"            /* ....я+..+.яя.... */
	$"0000 00FF 2B7F 7F2B 7F7F 7FFF FF00 0000"            /* ...я+..+...яя... */
	$"0000 FF2B 2B7F 7F2B 7F7F 7F2B FFFF 0000"            /* ..я++..+...+яя.. */
	$"00FF 2B2B 2B7F 7F2B FFFF FFFF 2BFF FF00"            /* .я+++..+яяяя+яя. */
	$"FF2B 2B2B 2B7F 7FFF FF08 08FF FF2B FFFF"            /* я++++..яя..яя+яя */
	$"FFFF 2B2B 2B7F 7FFF FFFF 0808 FFFF FF00"            /* яя+++..яяя..яяя. */
	$"00FF FF2B 2B7F FF08 FFFF FFFF 08FF FFFF"            /* .яя++.я.яяяя.яяя */
	$"0000 FFFF 2B7F 7FFF 0808 0808 0808 FFFF"            /* ..яя+..я......яя */
	$"0000 00FF FF2B 7F7F FFFF FFFF FF08 FFFF"            /* ...яя+..яяяяя.яя */
	$"0000 0000 FFFF 7F7F 7FF9 FF00 00FF FFFF"            /* ....яя...щя..яяя */
	$"0000 0000 00FF FF7F F9FF 0000 0000 0000"            /* .....яя.щя...... */
	$"0000 0000 0000 FFFF FF00 0000 0000 0000"            /* ......яяя....... */
	$"0000 0000 0000 00FF 0000 0000 0000 0000"            /* .......я........ */
};

data 'ics8' (128) {
	$"0000 0000 0000 00FF FF00 0000 0000 0000"            /* .......яя....... */
	$"0000 0000 0000 FF7F FFFF 0000 0000 0000"            /* ......я.яя...... */
	$"0000 0000 00FF 7F7F 7FFF FF00 0000 0000"            /* .....я...яя..... */
	$"0000 0000 FF2B 7F7F 2B7F FFFF 0000 0000"            /* ....я+..+.яя.... */
	$"0000 00FF 2B7F 7F2B 7F7F 7FFF FF00 0000"            /* ...я+..+...яя... */
	$"0000 FF2B 2B7F 7F2B 7F7F 7F2B FFFF 0000"            /* ..я++..+...+яя.. */
	$"00FF 2B2B 2B7F 7F2B FFFF FFFF 2BFF FF00"            /* .я+++..+яяяя+яя. */
	$"FF2B 2B2B 2B7F 7FFF FF08 08FF FF2B FFFF"            /* я++++..яя..яя+яя */
	$"FFFF 2B2B 2B7F 7FFF FFFF 0808 FFFF FF00"            /* яя+++..яяя..яяя. */
	$"00FF FF2B 2B7F FF08 FFFF FFFF 08FF FFFF"            /* .яя++.я.яяяя.яяя */
	$"0000 FFFF 2B7F 7FFF 0808 0808 0808 FFFF"            /* ..яя+..я......яя */
	$"0000 00FF FF2B 7F7F FFFF FFFF FF08 FFFF"            /* ...яя+..яяяяя.яя */
	$"0000 0000 FFFF 7F7F 7FF9 FF00 00FF FFFF"            /* ....яя...щя..яяя */
	$"0000 0000 00FF FF7F F9FF 0000 0000 0000"            /* .....яя.щя...... */
	$"0000 0000 0000 FFFF FF00 0000 0000 0000"            /* ......яяя....... */
	$"0000 0000 0000 00FF 0000 0000 0000 0000"            /* .......я........ */
};

data 'ics8' (129) {
	$"0000 FFFF FFFF FFFF FFFF FF00 0000 0000"            /* ..яяяяяяяяя..... */
	$"0000 FF2B 2B2B 7F2B 2BFF FFFF 0000 0000"            /* ..я+++.++яяя.... */
	$"0000 FF2B 2B7F 7F7F 2BFF F5FF FF00 0000"            /* ..я++...+яхяя... */
	$"0000 FF2B 7F7F 7F7F 7FFF FFFF FFFF 0000"            /* ..я+.....яяяяя.. */
	$"0000 FF2B 7F7F 7F2B 7F7F 2B2B F8FF 0000"            /* ..я+...+..++шя.. */
	$"0000 FF2B 7F7F 2B7F 7F7F 2B2B F8FF 0000"            /* ..я+..+...++шя.. */
	$"0000 FF7F 7F7F 2B7F 7F2B 2B2B F8FF 0000"            /* ..я...+..+++шя.. */
	$"0000 FF7F 7F7F 2B7F 7F2B 2B2B F8FF 0000"            /* ..я...+..+++шя.. */
	$"0000 FF7F 7F7F 2B7F 7F2B 2B2B F8FF 0000"            /* ..я...+..+++шя.. */
	$"0000 FF7F 7F7F 2BE3 E3E3 E3E3 F8FF E3A5"            /* ..я...+гггггшягҐ */
	$"0000 FF2B 7F7F 7FE3 9F9F 9F9F 9F9F 9FA5"            /* ..я+...гџџџџџџџҐ */
	$"0000 FF2B 7F7F 7FE3 9F9F 9F9F 9F9F 9FA5"            /* ..я+...гџџџџџџџҐ */
	$"0000 FF2B 7F7F 7FE3 9F9F 9F9F 9F9F 9FA5"            /* ..я+...гџџџџџџџҐ */
	$"0000 FF2B 2B7F 7FE3 9F9F 9F9F 9F9F 9FA5"            /* ..я++..гџџџџџџџҐ */
	$"0000 FF2B 2B2B 7FA5 A5A5 A5A5 F8FF A5A5"            /* ..я+++.ҐҐҐҐҐшяҐҐ */
	$"0000 FFFF FFFF FFFF FFFF FFFF FFFF 0000"            /* ..яяяяяяяяяяяя.. */
};

data 'ics8' (130) {
	$"0000 FFFF FFFF FFFF FFFF FF00 0000 0000"            /* ..яяяяяяяяя..... */
	$"0000 FF2B 7F7F 2B2B 2BFF FFFF 0000 0000"            /* ..я+..+++яяя.... */
	$"0000 FF7F 7F2B 7F2B 2BFF F5FF FF00 0000"            /* ..я..+.++яхяя... */
	$"0000 FF7F 2B7F 7F2B 2BFF FFFF FFFF 0000"            /* ..я.+..++яяяяя.. */
	$"0000 FF7F 2B7F 7F2B 2B2B 2B2B F8FF 0000"            /* ..я.+..+++++шя.. */
	$"0000 FF7F 7F2B 7F2B 2B2B 2B2B F8FF 0000"            /* ..я..+.+++++шя.. */
	$"0000 FF2B 7F7F 2B2B 2B2B 2B2B F8FF 0000"            /* ..я+..++++++шя.. */
	$"0000 FF2B 2B2B 2B2B 2B2B 2B2B F8FF 0000"            /* ..я+++++++++шя.. */
	$"0000 FF2B FD2B FD2B FDFD 2B2B F8FF 0000"            /* ..я+э+э+ээ++шя.. */
	$"0000 FFFD FDFD 2BFD FDFD E3E3 F8FF E3A5"            /* ..яэээ+эээггшягҐ */
	$"0000 FFFD FD2B FDE3 9F9F 9F9F 9F9F 9FA5"            /* ..яээ+эгџџџџџџџҐ */
	$"0000 FF2B FD2B FDE3 9F9F 9F9F 9F9F 9FA5"            /* ..я+э+эгџџџџџџџҐ */
	$"0000 FFFD 2BFD FDE3 9F9F 9F9F 9F9F 9FA5"            /* ..яэ+ээгџџџџџџџҐ */
	$"0000 FF2B FD2B FDFD 9F9F 9F9F 9F9F 9FA5"            /* ..я+э+ээџџџџџџџҐ */
	$"0000 FF2B 2B2B 2BA5 A5A5 A5A5 F8FF A5A5"            /* ..я++++ҐҐҐҐҐшяҐҐ */
	$"0000 FFFF FFFF FFFF FFFF FFFF FFFF 0000"            /* ..яяяяяяяяяяяя.. */
};

resource 'open' (128) {
	'3PRM',
	{	'TEXT'
	}
};

resource 'kind' (1000)
{
   '3PRM',
   verUS,
   {
      'apnm',			      "Clean",
      'TEXT',                 "Clean text document",
      'CgOb',                 "Clean code object",
      'APPL',                 "Clean IDE application",
   }
}; 

#include "aboutIde.r"

read 'icns' (128) "carbonIde.app.icns";
read 'icns' (129) "carbonIde.txt.icns";
read 'icns' (130) "carbonIde.obj.icns";
read 'plst' (0) "carbonIde.plist";
