data 'BNDL' (128) {
	$"5052 4850 0000 0001 4652 4546 0000 0000"            /* PRHP....FREF.... */
	$"0080 4943 4E23 0000 0000 0080"                      /* .€ICN#.....€ */
};

data 'FREF' (128) {
	$"5052 4850 0000 00"                                  /* PRHP... */
};

data 'icl4' (128) {
	$"0000 FFFF FFFF FFFF FFFF 0000 0000 0000"            /* ..ÿÿÿÿÿÿÿÿ...... */
	$"0000 F000 0000 0000 000F F000 0000 0000"            /* ..ð.......ð..... */
	$"0000 F0CC CCCC CCCC CCCF 0F00 0000 0000"            /* ..ðÌÌÌÌÌÌÏ...... */
	$"0000 F0CC CCCC DCCC CCCF 0CF0 0000 0000"            /* ..ðÌÌÌÜÌÌÏ.ð.... */
	$"0000 F0CC CCCD DDCC CCCF 0CCF 0000 0000"            /* ..ðÌÌÍÝÌÌÏ.Ï.... */
	$"0000 F0CC CCDD DDDC CCCF 0CCC F000 0000"            /* ..ðÌÌÝÝÜÌÏ.Ìð... */
	$"0000 F0CC CCDD DDDD CCCF 0CCC CF00 0000"            /* ..ðÌÌÝÝÝÌÏ.ÌÏ... */
	$"0000 F0CC CDDD DDDC DCCF FFFF FFF0 0000"            /* ..ðÌÍÝÝÜÜÏÿÿÿð.. */
	$"0000 F0CC CDDD DDCD DDCC CCCC CCF0 0000"            /* ..ðÌÍÝÝÍÝÌÌÌÌð.. */
	$"0000 F0CC DDDD DCDD DDDC CCCC CCF0 0000"            /* ..ðÌÝÝÜÝÝÜÌÌÌð.. */
	$"0000 F0CC DDDD DCDD DDDD CCCC CCF0 0000"            /* ..ðÌÝÝÜÝÝÝÌÌÌð.. */
	$"0000 F0CC DDDD DCDD DDDC CCCC CCF0 0000"            /* ..ðÌÝÝÜÝÝÜÌÌÌð.. */
	$"0000 F0CD DDDD CDDD DDCC CCCC CCF0 0000"            /* ..ðÍÝÝÍÝÝÌÌÌÌð.. */
	$"0000 F0CD DDDD CDDD DDCC CCCC CCF0 0000"            /* ..ðÍÝÝÍÝÝÌÌÌÌð.. */
	$"0000 F0CD DDDD CDDD DDCC CCCC CCF0 0000"            /* ..ðÍÝÝÍÝÝÌÌÌÌð.. */
	$"0000 F0CD DDDD CDDD DDCC CCCC CCF0 0000"            /* ..ðÍÝÝÍÝÝÌÌÌÌð.. */
	$"0000 F0CD DDDD CDDD DDCC CCCC CCF0 0000"            /* ..ðÍÝÝÍÝÝÌÌÌÌð.. */
	$"0000 F0CD DDDD CDDD DDCC CCCC CCF0 0000"            /* ..ðÍÝÝÍÝÝÌÌÌÌð.. */
	$"0000 F0CD DDDD CDDD DDCC CCCC CCF0 0000"            /* ..ðÍÝÝÍÝÝÌÌÌÌð.. */
	$"0000 F0CD DDDD CDD8 8888 8888 8888 88E0"            /* ..ðÍÝÝÍØˆˆˆˆˆˆˆà */
	$"0000 F0CC DDDD DCD8 DDDD DDDD DDDD DDE0"            /* ..ðÌÝÝÜØÝÝÝÝÝÝÝà */
	$"0000 F0CC DDDD DCD8 D0DD DDDD DD0D DDE0"            /* ..ðÌÝÝÜØÐÝÝÝÝ.Ýà */
	$"0000 F0CC DDDD DCD8 D000 D0DD 0D00 0DE0"            /* ..ðÌÝÝÜØÐ.ÐÝ...à */
	$"0000 F0CC CDDD DDC8 D0DD DD00 DD0D DDE0"            /* ..ðÌÍÝÝÈÐÝÝ.Ý.Ýà */
	$"0000 F0CC CDDD DDD8 D0DD DD00 DD0D DDE0"            /* ..ðÌÍÝÝØÐÝÝ.Ý.Ýà */
	$"0000 F0CC CCDD DDD8 DD00 D0DD 0DD0 0DE0"            /* ..ðÌÌÝÝØÝ.ÐÝ.Ð.à */
	$"0000 F0CC CCDD DDD8 DDDD DDDD DDDD DDE0"            /* ..ðÌÌÝÝØÝÝÝÝÝÝÝà */
	$"0000 F0CC CCCD DDC8 DDDD DDDD DDDD DDE0"            /* ..ðÌÌÍÝÈÝÝÝÝÝÝÝà */
	$"0000 F0CC CCCC DCCE EEEE EEEE EEEE EEE0"            /* ..ðÌÌÌÜÎîîîîîîîà */
	$"0000 F0CC CCCC CCCC CCCC CCCC CCF0 0000"            /* ..ðÌÌÌÌÌÌÌÌÌÌð.. */
	$"0000 F0CC CCCC CCCC CCCC CCCC CCF0 0000"            /* ..ðÌÌÌÌÌÌÌÌÌÌð.. */
	$"0000 FFFF FFFF FFFF FFFF FFFF FFF0 0000"            /* ..ÿÿÿÿÿÿÿÿÿÿÿð.. */
};

data 'icl8' (128) {
	$"0000 0000 FFFF FFFF FFFF FFFF FFFF FFFF"            /* ....ÿÿÿÿÿÿÿÿÿÿÿÿ */
	$"FFFF FFFF 0000 0000 0000 0000 0000 0000"            /* ÿÿÿÿ............ */
	$"0000 0000 FFF5 F5F5 F5F5 F5F5 F5F5 F5F5"            /* ....ÿõõõõõõõõõõõ */
	$"F5F5 F5FF FF00 0000 0000 0000 0000 0000"            /* õõõÿÿ........... */
	$"0000 0000 FFF5 2A2B 2A2B 2A2B 2A2B 2A2B"            /* ....ÿõ*+*+*+*+*+ */
	$"2A2B 2AFF F5FF 0000 0000 0000 0000 0000"            /* *+*ÿõÿ.......... */
	$"0000 0000 FFF5 2B2A 2B2A 2B2A 7F2A 2B2A"            /* ....ÿõ+*+*+*.*+* */
	$"2B2A 2BFF F52A FF00 0000 0000 0000 0000"            /* +*+ÿõ*ÿ......... */
	$"0000 0000 FFF5 2A2B 2A2B 2A7F 7F7F 2A2B"            /* ....ÿõ*+*+*...*+ */
	$"2A2B 2AFF F52B 2AFF 0000 0000 0000 0000"            /* *+*ÿõ+*ÿ........ */
	$"0000 0000 FFF5 2B2A 2B2A 7F7F 7F7F 7F2A"            /* ....ÿõ+*+*.....* */
	$"2B2A 2BFF F52A 2B2A FF00 0000 0000 0000"            /* +*+ÿõ*+*ÿ....... */
	$"0000 0000 FFF5 2A2B 2A2B 7F7F 7F7F 7F7F"            /* ....ÿõ*+*+...... */
	$"2A2B 2AFF F5F8 F8F8 F8FF 0000 0000 0000"            /* *+*ÿõøøøøÿ...... */
	$"0000 0000 FFF5 2B2A 2B7F 7F7F 7F7F 7F2A"            /* ....ÿõ+*+......* */
	$"7F2A 2BFF FFFF FFFF FFFF FF00 0000 0000"            /* .*+ÿÿÿÿÿÿÿÿ..... */
	$"0000 0000 FFF5 2A2B 2A7F 7F7F 7F7F 2A7F"            /* ....ÿõ*+*.....*. */
	$"7F7F 2A2B 2A2B 2A2B 2AF8 FF00 0000 0000"            /* ..*+*+*+*øÿ..... */
	$"0000 0000 FFF5 2B2A 7F7F 7F7F 7F2A 7F7F"            /* ....ÿõ+*.....*.. */
	$"7F7F 7F2A 2B2A 2B2A 2BF8 FF00 0000 0000"            /* ...*+*+*+øÿ..... */
	$"0000 0000 FFF5 2A2B 7F7F 7F7F 7F2B 7F7F"            /* ....ÿõ*+.....+.. */
	$"7F7F 7F7F 2A2B 2A2B 2AF8 FF00 0000 0000"            /* ....*+*+*øÿ..... */
	$"0000 0000 FFF5 2B2A 7F7F 7F7F 7F2A 7F7F"            /* ....ÿõ+*.....*.. */
	$"7F7F 7F2A 2B2A 2B2A 2BF8 FF00 0000 0000"            /* ...*+*+*+øÿ..... */
	$"0000 0000 FFF5 2A7F 7F7F 7F7F 2A7F 7F7F"            /* ....ÿõ*.....*... */
	$"7F7F 2A2B 2A2B 2A2B 2AF8 FF00 0000 0000"            /* ..*+*+*+*øÿ..... */
	$"0000 0000 FFF5 2B7F 7F7F 7F7F 2B7F 7F7F"            /* ....ÿõ+.....+... */
	$"7F7F 2B2A 2B2A 2B2A 2BF8 FF00 0000 0000"            /* ..+*+*+*+øÿ..... */
	$"0000 0000 FFF5 2A7F 7F7F 7F7F 2A7F 7F7F"            /* ....ÿõ*.....*... */
	$"7F7F 2A2B 2A2B 2A2B 2AF8 FF00 0000 0000"            /* ..*+*+*+*øÿ..... */
	$"0000 0000 FFF5 2B7F 7F7F 7F7F 2B7F 7F7F"            /* ....ÿõ+.....+... */
	$"7F7F 2B2A 2B2A 2B2A 2BF8 FF00 0000 0000"            /* ..+*+*+*+øÿ..... */
	$"0000 0000 FFF5 2A7F 7F7F 7F7F 2A7F 7F7F"            /* ....ÿõ*.....*... */
	$"7F7F 2A2B 2A2B 2A2B 2AF8 FF00 0000 0000"            /* ..*+*+*+*øÿ..... */
	$"0000 0000 FFF5 2B7F 7F7F 7F7F 2B7F 7F7F"            /* ....ÿõ+.....+... */
	$"7F7F 2B2A 2B2A 2B2A 2BF8 FF00 0000 0000"            /* ..+*+*+*+øÿ..... */
	$"0000 0000 FFF5 2A7F 7F7F 7F7F 2A7F 7F7F"            /* ....ÿõ*.....*... */
	$"7F7F 2A2B 2A2B 2A2B 2AF8 FF00 0000 0000"            /* ..*+*+*+*øÿ..... */
	$"0000 0000 FFF5 2B7F 7F7F 7F7F 2B7F 7FE3"            /* ....ÿõ+.....+..ã */
	$"E3E3 E3E3 E3E3 E3E3 E3E3 E3E3 E3E3 A500"            /* ãããããããããããããã¥. */
	$"0000 0000 FFF5 2A2B 7F7F 7F7F 7F2B 7FE3"            /* ....ÿõ*+.....+.ã */
	$"9F9F 9F9F 9F9F 9F9F 9F9F 9F9F 9F9F A500"            /* ŸŸŸŸŸŸŸŸŸŸŸŸŸŸ¥. */
	$"0000 0000 FFF5 2B2A 7F7F 7F7F 7F2A 7FE3"            /* ....ÿõ+*.....*.ã */
	$"9F00 9F9F 9F9F 9F9F 9F9F 009F 9F9F A500"            /* Ÿ.ŸŸŸŸŸŸŸŸ.ŸŸŸ¥. */
	$"0000 0000 FFF5 2A2B 7F7F 7F7F 7F2B 7FE3"            /* ....ÿõ*+.....+.ã */
	$"9F00 0000 9F00 9F9F 009F 0000 009F A500"            /* Ÿ...Ÿ.ŸŸ.Ÿ...Ÿ¥. */
	$"0000 0000 FFF5 2B2A 2B7F 7F7F 7F7F 2BE3"            /* ....ÿõ+*+.....+ã */
	$"9F00 9F9F 9F9F 0000 9F9F 009F 9F9F A500"            /* Ÿ.ŸŸŸŸ..ŸŸ.ŸŸŸ¥. */
	$"0000 0000 FFF5 2A2B 2A7F 7F7F 7F7F 7FE3"            /* ....ÿõ*+*......ã */
	$"9F00 9F9F 9F9F 0000 9F9F 009F 9F9F A500"            /* Ÿ.ŸŸŸŸ..ŸŸ.ŸŸŸ¥. */
	$"0000 0000 FFF5 2B2A 2B2A 7F7F 7F7F 7FE3"            /* ....ÿõ+*+*.....ã */
	$"9F9F 0000 9F00 9F9F 009F 9F00 009F A500"            /* ŸŸ..Ÿ.ŸŸ.ŸŸ..Ÿ¥. */
	$"0000 0000 FFF5 2A2B 2A2B 7F7F 7F7F 7FE3"            /* ....ÿõ*+*+.....ã */
	$"9F9F 9F9F 9F9F 9F9F 9F9F 9F9F 9F9F A500"            /* ŸŸŸŸŸŸŸŸŸŸŸŸŸŸ¥. */
	$"0000 0000 FFF5 2B2A 2B2A 2B7F 7F7F 2BE3"            /* ....ÿõ+*+*+...+ã */
	$"9F9F 9F9F 9F9F 9F9F 9F9F 9F9F 9F9F A500"            /* ŸŸŸŸŸŸŸŸŸŸŸŸŸŸ¥. */
	$"0000 0000 FFF5 2A2B 2A2B 2A2B 7F2B 2AA5"            /* ....ÿõ*+*+*+.+*¥ */
	$"A5A5 A5A5 A5A5 A5A5 A5A5 A5A5 A5A5 A500"            /* ¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥. */
	$"0000 0000 FFF5 2B2A 2B2A 2B2A 2B2A 2B2A"            /* ....ÿõ+*+*+*+*+* */
	$"2B2A 2B2A 2B2A 2B2A 2BF8 FF00 0000 0000"            /* +*+*+*+*+øÿ..... */
	$"0000 0000 FFF5 F8F8 F8F8 F8F8 F8F8 F8F8"            /* ....ÿõøøøøøøøøøø */
	$"F8F8 F8F8 F8F8 F8F8 F8F8 FF00 0000 0000"            /* øøøøøøøøøøÿ..... */
	$"0000 0000 FFFF FFFF FFFF FFFF FFFF FFFF"            /* ....ÿÿÿÿÿÿÿÿÿÿÿÿ */
	$"FFFF FFFF FFFF FFFF FFFF FF00 0000 0000"            /* ÿÿÿÿÿÿÿÿÿÿÿ..... */
};

data 'ICN#' (128) {
	$"0FFF F000 0800 1800 0800 1400 0808 1200"            /* .ÿð............. */
	$"081C 1100 083E 1080 083F 1040 087E 9FE0"            /* .....>.€.?.@.~Ÿà */
	$"087D C020 08FB E020 08FB F020 08FB E020"            /* .}À .ûà .ûð .ûà  */
	$"09F7 C020 09F7 C020 09F7 C020 09F7 C020"            /* Æ÷À Æ÷À Æ÷À Æ÷À  */
	$"09F7 C020 09F7 C020 09F7 C020 09F7 FFFE"            /* Æ÷À Æ÷À Æ÷À Æ÷ÿþ */
	$"08FB FFFE 08FB BFDE 08FB 8B46 087D BCDE"            /* .ûÿþ.û¿Þ.û‹F.}¼Þ */
	$"087F BCDE 083F CB66 083F FFFE 081D FFFE"            /* ..¼Þ.?Ëf.?ÿþ..ÿþ */
	$"0809 FFFE 0800 0020 0800 0020 0FFF FFE0"            /* .Æÿþ... ... .ÿÿà */
	$"0FFF F000 0FFF F800 0FFF FC00 0FFF FE00"            /* .ÿð..ÿø..ÿü..ÿþ. */
	$"0FFF FF00 0FFF FF80 0FFF FFC0 0FFF FFE0"            /* .ÿÿ..ÿÿ€.ÿÿÀ.ÿÿà */
	$"0FFF FFE0 0FFF FFE0 0FFF FFE0 0FFF FFE0"            /* .ÿÿà.ÿÿà.ÿÿà.ÿÿà */
	$"0FFF FFE0 0FFF FFE0 0FFF FFE0 0FFF FFE0"            /* .ÿÿà.ÿÿà.ÿÿà.ÿÿà */
	$"0FFF FFE0 0FFF FFE0 0FFF FFE0 0FFF FFFE"            /* .ÿÿà.ÿÿà.ÿÿà.ÿÿþ */
	$"0FFF FFFE 0FFF FFFE 0FFF FFFE 0FFF FFFE"            /* .ÿÿþ.ÿÿþ.ÿÿþ.ÿÿþ */
	$"0FFF FFFE 0FFF FFFE 0FFF FFFE 0FFF FFFE"            /* .ÿÿþ.ÿÿþ.ÿÿþ.ÿÿþ */
	$"0FFF FFFE 0FFF FFE0 0FFF FFE0 0FFF FFE0"            /* .ÿÿþ.ÿÿà.ÿÿà.ÿÿà */
};

data 'ics#' (128) {
	$"3FE0 2270 2758 2FFC 2EC4 2DC4 3D84 3D84"            /* ?à"p'X/ü.Ä-Ä=„=„ */
	$"3D84 3DF7 2FFF 2FFF 2FFF 27FF 23F7 3FFC"            /* =„=÷/ÿ/ÿ/ÿ'ÿ#÷?ü */
	$"3FE0 3FF0 3FF8 3FFC 3FFC 3FFC 3FFC 3FFC"            /* ?à?ð?ø?ü?ü?ü?ü?ü */
	$"3FFC 3FFF 3FFF 3FFF 3FFF 3FFF 3FFF 3FFC"            /* ?ü?ÿ?ÿ?ÿ?ÿ?ÿ?ÿ?ü */
};

data 'ics4' (128) {
	$"00FF FFFF FFF0 0000 00FC CCDC CFFF 0000"            /* .ÿÿÿÿð...üÌÜÏÿ.. */
	$"00FC CDDD CF0F F000 00FC DDDD DFFF FF00"            /* .üÍÝÏ.ð..üÝÝßÿÿ. */
	$"00FC DDDC DDCC CF00 00FC DDCD DDCC CF00"            /* .üÝÜÝÌÏ..üÝÍÝÌÏ. */
	$"00FD DDCD DCCC CF00 00FD DDCD DCCC CF00"            /* .ýÝÍÜÌÏ..ýÝÍÜÌÏ. */
	$"00FD DDCD DCCC CF00 00FD DDC8 8888 CF8E"            /* .ýÝÍÜÌÏ..ýÝÈˆˆÏŽ */
	$"00FC DDD8 DDDD DDDE 00FC DDD8 DDDD DDDE"            /* .üÝØÝÝÝÞ.üÝØÝÝÝÞ */
	$"00FC DDD8 DDDD DDDE 00FC CDD8 DDDD DDDE"            /* .üÝØÝÝÝÞ.üÍØÝÝÝÞ */
	$"00FC CCDE EEEE CFEE 00FF FFFF FFFF FF00"            /* .üÌÞîîÏî.ÿÿÿÿÿÿ. */
};

data 'ics8' (128) {
	$"0000 FFFF FFFF FFFF FFFF FF00 0000 0000"            /* ..ÿÿÿÿÿÿÿÿÿ..... */
	$"0000 FF2B 2B2B 7F2B 2BFF FFFF 0000 0000"            /* ..ÿ+++.++ÿÿÿ.... */
	$"0000 FF2B 2B7F 7F7F 2BFF F5FF FF00 0000"            /* ..ÿ++...+ÿõÿÿ... */
	$"0000 FF2B 7F7F 7F7F 7FFF FFFF FFFF 0000"            /* ..ÿ+.....ÿÿÿÿÿ.. */
	$"0000 FF2B 7F7F 7F2B 7F7F 2B2B F8FF 0000"            /* ..ÿ+...+..++øÿ.. */
	$"0000 FF2B 7F7F 2B7F 7F7F 2B2B F8FF 0000"            /* ..ÿ+..+...++øÿ.. */
	$"0000 FF7F 7F7F 2B7F 7F2B 2B2B F8FF 0000"            /* ..ÿ...+..+++øÿ.. */
	$"0000 FF7F 7F7F 2B7F 7F2B 2B2B F8FF 0000"            /* ..ÿ...+..+++øÿ.. */
	$"0000 FF7F 7F7F 2B7F 7F2B 2B2B F8FF 0000"            /* ..ÿ...+..+++øÿ.. */
	$"0000 FF7F 7F7F 2BE3 E3E3 E3E3 F8FF E3A5"            /* ..ÿ...+ãããããøÿã¥ */
	$"0000 FF2B 7F7F 7FE3 9F9F 9F9F 9F9F 9FA5"            /* ..ÿ+...ãŸŸŸŸŸŸŸ¥ */
	$"0000 FF2B 7F7F 7FE3 9F9F 9F9F 9F9F 9FA5"            /* ..ÿ+...ãŸŸŸŸŸŸŸ¥ */
	$"0000 FF2B 7F7F 7FE3 9F9F 9F9F 9F9F 9FA5"            /* ..ÿ+...ãŸŸŸŸŸŸŸ¥ */
	$"0000 FF2B 2B7F 7FE3 9F9F 9F9F 9F9F 9FA5"            /* ..ÿ++..ãŸŸŸŸŸŸŸ¥ */
	$"0000 FF2B 2B2B 7FA5 A5A5 A5A5 F8FF A5A5"            /* ..ÿ+++.¥¥¥¥¥øÿ¥¥ */
	$"0000 FFFF FFFF FFFF FFFF FFFF FFFF 0000"            /* ..ÿÿÿÿÿÿÿÿÿÿÿÿ.. */
};

data 'PRHP' (0, "Owner resource") {
	$"0000 0000 0000 0000 0000 0000 07FE 66E0"            /* .............þfà */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"07FE 6850 0000 0000 0001 00C0 0800 38D0"            /* .þhP.......À..8Ð */
	$"0000 0000 0000 0000 0000 0000 07FE 66E0"            /* .............þfà */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"07FE 6820 0000 0000 0001 0210 0800 38D0"            /* .þh ..........8Ð */
	$"0000 0000 0000 0000 0000 0000 07FE 66E0"            /* .............þfà */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
};
